<template>
    <div class="privacy-policy-wrap">
      <div class="title-wrap">隐私政策</div>
      <div class="content-wrap">
        <p>本平台非常重视保护您的个人隐私。</p>
  
        <p>
          本平台已经开展了丰富多彩的内容业务。为方便您登录，以及为您提供更个性化的服务，您在使用我们的服务时，我们可能会收集和使用您的相关信息。为说明在线刷题平台（以下简称平台）会如何收集、使用和存储并保护您的个人信息及您享有何种权利，我们将通过本协议向您阐述相关事宜，其中要点如下：
        </p>
        <p>
          1、我们将逐一说明我们收集的您的个人信息类型及其对应的用途，以便您了解我们针对某一特定功能所收集的具体个人信息的类别、使用理由及收集方式。
        </p>
        <p>
          2、目前，在线刷题平台不会主动共享或转让您的个人信息至本平台以外的第三方，如存在其他共享或转让您的个人信息情形时，我们会征得您的明示同意，此外我们会对对外提供信息的行为进行风险评估。
        </p>
        <p>
          4、您可以通过本声明所列途径访问、更正、删除您的个人信息，也可以撤回同意、注销帐号、投诉举报。
        </p>
        <p>
          您使用我们的服务，即意味着您已经同意我们按照本隐私政策收集、使用、储存和披露您的相关信息，以及向您提供的控制和保护措施。
        </p>
        <p class="no-indent">一、信息收集范围</p>
        <p>
          在您使用在线刷题服务的过程中，本平台会按照如下方式收集您在使用服务时主动提供或因为使用服务而产生的信息，用以向您提供服务、优化我们的服务以及保障您的帐号安全：
        </p>
        <p>
          1.1
          当您进入某些刷题服务前（较少），我们可能会获取您的微信头像、微信昵称信息，收集微信头像和昵称信息是为了保障您的做题结果与您的账号相关联并保留。
        </p>
       
       
        <p class="no-indent">二、信息的存储</p>
        <p>2.1 信息存储的地点</p>
        <p>我们会按照法律法规规定，将境内收集的用户个人信息存储于中国境内。</p>
        <p>2.2 信息存储的期限</p>
        <p>
          一般而言，我们仅为实现目的所必需的时间保留您的个人信息，例如：微信头像和微信昵称，若您需要使用刷题服务，我们需要一直保存您的微信头像和微信昵称，以保证您正常使用该服务，当您一段时间未进入网页或程序后，我们将删除相应的信息；当我们的产品或服务发生停止运营的情形时，我们将以推送微信服务消息通知、短信等形式通知您，并在合理的期限内删除您的个人信息或进行匿名化处理。
        </p>
        <p class="no-indent">三、信息安全</p>
        <p>
          我们努力为用户的信息安全提供保障，以防止信息的丢失、不当使用、未经授权访问或披露。
        </p>
        <p>
          我们将在合理的安全水平内使用各种安全保护措施以保障信息的安全。例如，我们会使用加密技术（例如，SSL）、匿名化处理等手段来保护您的个人信息。我们通过不断提升的技术手段加强我们产品的安全能力，以防止您的个人信息泄露。例如，我们为了安全传输会在您的设备本地完成部分信息加密的工作。我们建立专门的管理制度、流程和组织以保障信息的安全。例如，我们严格限制访问信息的人员范围，要求他们遵守保密义务，并进行审计。若发生个人信息泄露等安全事件，我们会启动应急预案，阻止安全事件扩大，并以公告、短信等形式告知您。
        </p>
        <p class="no-indent">四、关于Cookie的使用</p>
        <p>
          为确保网页正常运转，为您提供更为便捷的访问体验，我们会在您的计算机或移动设备上存储名为Cookie的小数据文件。Cookie通常包含标识符、站点名称以及一些号码和字符。借助于cookie，网页或客户端能够存储您的偏好或历史报告等数据。我们不会将Cookie用于本协议所述目的之外的任何用途。您可根据自己的偏好管理或清除移动设备（或计算机）上保存的所有cookie.但如果您这么做则会影响我们为您提供更好的用户使用体验以及更方便的服务。
        </p>
        <p class="no-indent">五、信息共享、转让、披露</p>
        <p>
          除按法律法规规定外，我们不会主动对外公开披露所收集的个人信息，如须主动公开披露时，我们会向您告知此次公开披露的目的、披露信息的类型及可能涉及的敏感信息，并征得您的明示同意。
        </p>
        <p>
          本平台也不会主动共享或转让您的个人信息至本平台以外的第三方，如存在其他共享或转让您的个人信息情形时，我们会征得您的明示同意，此外我们会对对外提供信息的行为进行风险评估。
        </p>
        <p>
          随着我们业务的持续发展，我们将按照法律法规及不低于本声明所要求的标准继续保护或要求新的控制者继续保护您的个人信息。
        </p>
        <p class="no-indent">六、隐私政策的更新</p>
        <p>
          我们可能会适时对本声明进行修订。当声明的条款发生变更时，将会在网页的重要位置上提示修改内容。请您注意，只有在您勾选同意按钮后，我们才会按照更新后的声明收集、使用、存储您的个人信息。
        </p>
       
        <div v-if="wechatInfo?.companyName && wechatInfo?.companySite">
          <p class="no-indent">七、如何联系我们</p>
          <p>
            如您在参与活动的过程中对本隐私政策有任何疑问或建议，请通过以下联系方式与我们联系：
          </p>
          <p class="no-indent">经营者：武汉爱彼邻科技有限公司</p>
          <p class="no-indent">常用办公地址：武汉市洪山区光谷大道112-7-108-1</p>
          <p class="no-indent">联系方式：13971198127</p>
        </div>
      </div>
    </div>
  </template>
    
    <script>
  import { reactive, toRefs, computed, onMounted } from "vue";
  
  import { useStore } from "@/store";
  export default {
    name: "privacyPolicy",
    components: {},
    setup() {
      document.title = "隐私政策";
      const store = useStore();
      const state = reactive({});
      onMounted(async () => {});
      const wechatInfo = computed(() => store.getters.wechatInfo);
  
      return {
        ...toRefs(state),
        wechatInfo,
      };
    },
  };
  </script>
    
    <style lang="less" scoped>
  .privacy-policy-wrap {
    padding: 10px 20px 20px 20px;
    background: #fff;
    .title-wrap {
      font-size: 18px;
      font-weight: bold;
      margin-bottom: 20px;
      text-align: center;
    }
    .content-wrap {
      font-size: 14px;
      line-height: 2;
      p {
        margin-bottom: 10px;
        text-indent: 1.4em;
        &.no-indent {
          text-indent: 0 !important;
        }
      }
    }
  }
  </style>
    